; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v8)
		(pred_3 ?v6)
		(pred_6 ?v4)
		(pred_4 ?v4)
		(pred_2 ?v6 ?v4)
		(pred_1)
		(pred_5 ?v6))

   (:action op_3
       :parameters  (?v3 ?v2)
       :precondition (and (not-eq ?v3 ?v2) 
                          (pred_6 ?v3) (pred_6 ?v2) (pred_4 ?v3))
       :effect (and  (pred_4 ?v2)
		     (not (pred_4 ?v3))))


   (:action op_1
       :parameters (?v7 ?v5)
       :precondition  (and  (pred_3 ?v7) (pred_6 ?v5)
			    (pred_2 ?v7 ?v5) (pred_4 ?v5) (pred_1))
       :effect (and (pred_5 ?v7)
		    (not (pred_2 ?v7 ?v5)) 
		    (not (pred_1))))

   (:action op_2
       :parameters  (?v7  ?v5)
       :precondition  (and  (pred_3 ?v7) (pred_6 ?v5)
			    (pred_5 ?v7) (pred_4 ?v5))
       :effect (and (pred_2 ?v7 ?v5)
		    (pred_1)
		    (not (pred_5 ?v7)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_06 obj_05 obj_08 obj_07 obj_04 obj_09 
          obj_01 obj_02 obj_03 
)
(:init
(pred_6 obj_06)
(pred_6 obj_05)
(pred_6 obj_08)
(pred_6 obj_07)
(pred_6 obj_04)
(pred_6 obj_09)
(pred_3 obj_01)
(pred_3 obj_02)
(pred_3 obj_03)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_09)
(not-eq obj_09 obj_06)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_07)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_04)
(pred_1)
(pred_2 obj_01 obj_07)
(pred_2 obj_02 obj_04)
(pred_2 obj_03 obj_06)
(pred_4 obj_08)
)
(:goal
(and
(pred_2 obj_01 obj_07)
(pred_2 obj_02 obj_08)
(pred_2 obj_03 obj_08)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_02 obj_08) (pred_4 obj_06))
    (sometime-before  (pred_2 obj_03 obj_08) (pred_4 obj_05))
  )
)
)

; plan
1. (op_3 obj_08 obj_04)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_04)
   goals met: 1 of 3
2. (op_1 obj_02 obj_04)
   deleted: (pred_2 obj_02 obj_04) (pred_1)
   added: (pred_5 obj_02)
   goals met: 1 of 3
3. (op_3 obj_04 obj_05)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_05)
   goals met: 1 of 3
4. (op_2 obj_02 obj_05)
   deleted: (pred_5 obj_02)
   added: (pred_2 obj_02 obj_05) (pred_1)
   goals met: 1 of 3
5. (op_3 obj_05 obj_06)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_06)
   goals met: 1 of 3
6. (op_1 obj_03 obj_06)
   deleted: (pred_2 obj_03 obj_06) (pred_1)
   added: (pred_5 obj_03)
   goals met: 1 of 3
7. (op_3 obj_06 obj_08)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_08)
   goals met: 1 of 3
8. (op_2 obj_03 obj_08)
   deleted: (pred_5 obj_03)
   added: (pred_2 obj_03 obj_08) (pred_1)
   goals met: 2 of 3
9. (op_3 obj_08 obj_05)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_05)
   goals met: 2 of 3
10. (op_1 obj_02 obj_05)
   deleted: (pred_2 obj_02 obj_05) (pred_1)
   added: (pred_5 obj_02)
   goals met: 2 of 3
11. (op_3 obj_05 obj_08)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_08)
   goals met: 2 of 3
12. (op_2 obj_02 obj_08)
   deleted: (pred_5 obj_02)
   added: (pred_2 obj_02 obj_08) (pred_1)
   goals met: 3 of 3
